data = {
    "Powdery_mildew_on_melons": [
        {
            "No": "0",
            "degree": [
                0,
                20
            ],
            "Symptoms": "ใบมีผงสีขาวขึ้นเล็กน้อย",
            "Recommendation_purpose": "เพื่อป้องกันการเกิดโรค",
            "Recommended_method": [
                "   ควรตรวจแปลงปลูกอย่างสม่ำเสมอ หมั่นกำจัดวัชพืช ",
                "เพื่อให้มีการถ่ายเทอากาศในแปลงได้ดี เมื่อพบโรคเริ่มระบาด ",
                "พ่นด้วยสารป้องกันกำจัดโรค เช่น เบโนมิล 50% ดับเบิ้ลยู อัตรา 15-20 กรัมต่อน้ำ 20 ลิตร ",
                "หรือโพรพิเนบ 70 % ดับเบิ้ลยูพี อัตรา 40 กรัมต่อน้ำ 20 ลิตร ",
                "หรือฟลูโอไพแรม + ไตรฟลอกซีสฌตรบิน 25% +25% เอสซี ",
                "อัตรา 10 มิลลิลิตรต่อน้ำ 20 ลิตร หรือทีบูโคนาโซล + ไตรฟลอกซีสโตรบิน 50% +25% ดับเบิ้ลยูจี อัตรา 10 กรัมต่อน้ำ 20 ลิตร",
                " หรือเพนทิโอไพแรด 20 % เอสซี อัตรา 5 - 10 มิลลิลิตรต่อน้ำ 20 ลิตร พ่นทุก 5-7 วัน",
                " หรือจะใช้จุลินทรีย์ช่วยเช่น เชื้อราไตรโคเดอร์ม่า ฉีดพ่นในอัตรา เชื้อสด 1 กก.ต่อน้ำ 200 ลิตร",
                " พ่นในเวลาเย็น 2-3 ครั้ง ห่างกัน 5-7 วัน ",
                "นอกจากนี้ยังสามารถใช้ นีโอ-ไฟต์ อัตรา 300 ซีซี หรือ ไมโครบลูคอป 200 กรัม  ต่อน้ำ 200 ลิตร"
            ],
            "refer_arr": [
                {
                    "refer": "-  สำนักงานเกษตรและสหกรณ์ จังหวัดหนองบัวลำภู.2562.แจ้งเตือนภัย โรคราแป้งในพืชตระกูลแตง (เชื้อรา OIDIUM SP.) (ออนไลน์) ",
                    "url": " https://www.opsmoac.go.th/nongbualamphu-warning-preview-411991791969?fbclid=IwAR1UqF2myg6XxuMH6FW8_B88wMj2GXshErPcHouEawfFzpKb7x4sDt13r9g"
                },
                {
                    "refer": "-  คลินิกพืช สำนักวิจัยและพัฒนาการเกษตร เขตที่1 กรมวิชาการ.2562.ข่าวพยากรณ์และเตือนภัยการระบาดศัตรูพืช (ฉบับที่ 7/61)",
                    "url": None
                },
                {
                    "refer": "- ใส่ใจชีวิตเกษตรกร(เตือนภัย โรคราแป้งในพืชตระกูลแตง) (ออนไลน์)  ",
                    "url": "https://www.unilife.co.th/?agricultural_knowled=%E0%B9%80%E0%B8%95%E0%B8%B7%E0%B8%AD%E0%B8%99%E0%B8%A0%E0%B8%B1%E0%B8%A2-%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%83%E0%B8%9A%E0%B9%84%E0%B8%AB%E0%B8%A1%E0%B9%89%E0%B8%9C%E0%B8%A5%E0%B9%80%E0%B8%99-2"
                }
            ]
        },
        {
            "No": "1",
            "degree": [
                20,
                40
            ],
            "Symptoms": "ใบมีผงสีขาวกระจายที่ท้องใบ",
            "Recommendation_purpose": "เพื่อป้องกัน และกำจัดโรค",
            "Recommended_method": [
                "   ควรพ่นด้วยเบเลตัน ,ทอปซิน ตามที่ฉลากกำหนด หรือพ่นด้วย น้ำ 20 ลิตร/กำมะถัน 40 กรัม",
                "พ่นในตอนอุณหภูมิไม่สูง ไม่อย่างนั้นใบจะไหม้ได้  และเมื่อพบการระบาดของโรคแล้วอาจใช้เชื้อแบคทีเรีย ",
                "บาซีลัส ซับทีลิส ฉีดพ่นเวลาเย็น ใช้อัตรา 30 กรัม ต่อน้ำ 20 ลิตรและพ่นซ้ำทุก 7 วัน",
                "ควรพ่นในเวลาเช้าตรู่หรือเวลาเย็น หรือจะใช้ เบนเอฟ 100-200 ซีซี",
                "สลับ อะซอกซิสโตรบิน 50-100 ซีซี ต่อน้ำ 200 ลิตร",
                "หรือ ใช้สารคาราเทน (karathane) หรือมิลเด็กซ์ (mildex) ใช้ได้ดีกับเชื้อ Sphaerotheca",
                "โดยใช้สารเคมีดังกล่าว 125 – 180 กรัมละลายนํ้า 20 ลิตร ฉีดทุก 3 – 5 วัน"
            ],
            "refer_arr": [
                {
                    "refer": "-  ฐานข้อมูลพืชผัก บทความเกษตร",
                    "url": " https://vegetweb.com/"
                },
                {
                    "refer": "-  สำนักงานเกษตรและสหกรณ์ จังหวัดหนองบัวลำภู.2562.แจ้งเตือนภัย โรคราแป้งในพืชตระกูลแตง (เชื้อรา OIDIUM SP.) (ออนไลน์) ",
                    "url": " https://www.opsmoac.go.th/nongbualamphu-warning-preview-411991791969?fbclid=IwAR1UqF2myg6XxuMH6FW8_B88wMj2GXshErPcHouEawfFzpKb7x4sDt13r9g"
                },
                {
                    "refer": "- ใส่ใจชีวิตเกษตรกร(เตือนภัย โรคราแป้งในพืชตระกูลแตง) (ออนไลน์)  ",
                    "url": "https://www.unilife.co.th/?agricultural_knowled=%E0%B9%80%E0%B8%95%E0%B8%B7%E0%B8%AD%E0%B8%99%E0%B8%A0%E0%B8%B1%E0%B8%A2-%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%83%E0%B8%9A%E0%B9%84%E0%B8%AB%E0%B8%A1%E0%B9%89%E0%B8%9C%E0%B8%A5%E0%B9%80%E0%B8%99-2"
                },
                {
                    "refer": "- ไทยเกษตรศาสตร์ (การปลูกแตง: โรคราแป้งขาว) (ออนไลน์) ",
                    "url": " https://www.thaikasetsart.com/%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%9B%E0%B8%A5%E0%B8%B9%E0%B8%81%E0%B9%81%E0%B8%95%E0%B8%87%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%A3%E0%B8%B2%E0%B9%81%E0%B8%9B%E0%B9%89%E0%B8%87%E0%B8%82%E0%B8%B2%E0%B8%A7/"
                }
            ]
        },
        {
            "No": "2",
            "degree": [
                40,
                60
            ],
            "Symptoms": "ใบมีผงสีขาวกระจายทั้งท้องใบและหน้าใบ",
            "Recommendation_purpose": "เพื่อป้องกัน และกำจัดโรค",
            "Recommended_method": [
                "   ควรพ่นด้วยน้ำ 20 ลิตรและบาวีซาน 20 กรัม หรือ",
                " คาร์เบนดาซิม อัตรา 10 – 20 กรัม ต่อ น้ำ 20 ลิตร นอกจากนี้ยังสามารถใช้สูตรผสมเช่น ",
                " ฟลูโอไพแรม + ไตรฟลอกซีสโตรบิน 25% + 25% SC อัตรา 10 มิลลิลิตรต่อน้ำ  20 ลิตร",
                " หรือ ทีบูโคนาโซล + ไตรฟลอกซีสโตรบิน 50% + 25% WG อัตรา 10 กรัมต่อน้ำ 20 ลิตร ",
                " หรือ เพนทิโอไพแรด 20% SC อัตรา 5 - 10 มิลลิลิตรต่อน้ำ 20 ลิตร ",
                " หรือ โพรพิเนบ 70% WP อัตรา 40 กรัมต่อน้ำ 20 ลิตร ",
                " หรือ เตตระโคนาโซล 4% EW อัตรา 10 - 20 มิลลิลิตรต่อน้ำ 20 ลิตร พ่นทุก 5 - 7 วัน"
            ],
            "refer_arr": [
                {
                    "refer": "- (ออนไลน์) ",
                    "url": " https://www.allkaset.com/diseases%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%A3%E0%B8%B2%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%84%E0%B9%89%E0%B8%B2%E0%B8%87.php"
                },
                {
                    "refer": "-  คลินิกพืช สำนักวิจัยและพัฒนาการเกษตร เขตที่1 กรมวิชาการ.2562.ข่าวพยากรณ์และเตือนภัยการระบาดศัตรูพืช (ฉบับที่ 7/61)",
                    "url": None
                },
                {
                    "refer": "- กรมวิชาการเกษตร.2564.เตือนภัยเกษตร",
                    "url": None
                }
            ]
        },
        {
            "No": "3",
            "degree": [
                60,
                80
            ],
            "Symptoms": "ผงสีขาวกระจายทั่วใบเริ่มมีจุดแผลสีเหลือง",
            "Recommendation_purpose": "เพื่อป้องกัน และกำจัดโรค",
            "Recommended_method": [
                "   ควรใช้บาซิลลัส ซับทิลิส + เชื้อราไตรโคเดอร์มา ฉีดพ่น ",
                "หรือ ใช้กำมะถัน ชนิดละลายน้ำอัตรา 30- 40 กรัม ต่อน้ำ 20 ลิตร",
                " ฉีดในสภาพอุณหภูมิต่ำ ในกรณีที่อุณหภูมิสูงจะมีผลให้ใบของเมล่อนไหม้",
                " หรือใช้ 1 ลิตร ผสม ไอเอส 50 ซีซี ต่อน้ำ 20 ลิตรฉีดพ่นครอบคลุมบริเวณที่มีการระบาด 2 ครั้ง",
                " ห่างกัน 3-5 วัน และ FK1 1 ช้อนโต๊ะ ต่อน้ำ 20 ลิตร ฉีดพ่นต้นใบ ทรงพุ่มเพื่อสร้างภูมิคุ้มกัน"
            ],
            "refer_arr": [
                {
                    "refer": "- สวนเกษตรผสมผสาน นครปฐม ครบเครื่อง เรื่องเกษตรอินทรีย์ (โรคราแป้ง) ราน้ำค้าง  (ออนไลน์) ",
                    "url": " https://www.kasetkawna.com/article/391/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%A3%E0%B8%B2%E0%B9%81%E0%B8%9B%E0%B9%89%E0%B8%87?fbclid=IwAR3Wo5uRQ4iHkD2RG1cE-JLY8IjSL93uSmoZ2COUBkkyUoaTQRectqlweD8"
                },
                {
                    "refer": "-  คลินิกพืช สำนักวิจัยและพัฒนาการเกษตร เขตที่1 กรมวิชาการ.2562.ข่าวพยากรณ์และเตือนภัยการระบาดศัตรูพืช (ฉบับที่ 7/61)",
                    "url": None
                },
                {
                    "refer": "- ฟาร์มเกษตร (ออนไลน์) ",
                    "url": " https://www.farmkaset.org/html5/timeline-details.aspx?topicid=5691"
                }
            ]
        },
        {
            "No": "4",
            "degree": [
                80,
                100
            ],
            "Symptoms": "ผงสีขาวกระจายทั่วใบเป็นจุดแผลสีเหลืองซีด",
            "Recommendation_purpose": "เพื่อป้องกัน และกำจัดโรค",
            "Recommended_method": [
                "   ควรใช้บาซิลลัส โปร ผสมสารจับใบสำหรับชีวภัณฑ์ฉีดพ่นให้ทั่วทรงพุ่มในจุดที่เป็นโรคราแป้ง",
                " โดยใช้บาซิลลัส โปรในอัตรา 1 ลิตรต่อน้ำ 100 ลิตร ตามอาการระบาดและรุนแรงของโรค ",
                " โดยฉีดพ่น 3 ครั้งห่างกัน 3 วัน หลังจากเก็บเกี่ยวผลผลิต ควรเก็บซากพืชไปเผาทำลายนอกแปลงปลูก"
            ],
            "refer_arr": [
                {
                    "refer": "- สวนเกษตรผสมผสาน นครปฐม ครบเครื่อง เรื่องเกษตรอินทรีย์ (โรคราแป้ง) ราน้ำค้าง  (ออนไลน์) ",
                    "url": " https://www.kasetkawna.com/article/391/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%A3%E0%B8%B2%E0%B9%81%E0%B8%9B%E0%B9%89%E0%B8%87?fbclid=IwAR3Wo5uRQ4iHkD2RG1cE-JLY8IjSL93uSmoZ2COUBkkyUoaTQRectqlweD8"
                },
                {
                    "refer": "-  สำนักงานเกษตรและสหกรณ์ จังหวัดหนองบัวลำภู.2562.แจ้งเตือนภัย โรคราแป้งในพืชตระกูลแตง (เชื้อรา OIDIUM SP.) (ออนไลน์) ",
                    "url": " https://www.opsmoac.go.th/nongbualamphu-warning-preview-411991791969?fbclid=IwAR1UqF2myg6XxuMH6FW8_B88wMj2GXshErPcHouEawfFzpKb7x4sDt13r9g"
                },
                {
                    "refer": "-  สำนักงานเกษตรอำเภอสันทราย (ออนไลน์)  http://sansai.chiangmai.doae.go.th/?p=625",
                    "url": None
                }
            ]
        }
    ],
    "Downy_mildew_on_melons": [
        {
            "No": "0",
            "degree": [
                1,
                20
            ],
            "Symptoms": "ระยะป้องกันเริ่มต้น หรือ ใบเป็นจุดเล็กน้อย",
            "Recommendation_purpose": "เพื่อป้องกันการเกิดโรค",
            "Recommended_method": [
                "ก่อนปลูกควรแช่เมล็ดพันธุ์ในน้ำอุ่น 50 องศา นาน 20-30 นาที",
                "หรือคลุกเมล็ดด้วยสารเมลาแลกซิน 37% ดีเอส อัตรา 7 กรัมต่อเมล็ดพันธุ์ 1 กิโลกรัม ไม่ปลูกพืชแน่นเกินไป",
                " เพราะจะทำให้มีความชื้นสูงและควรให้น้ำในเวลาเช้าเพื่อเพิ่ความชื้นในเวลากลางวัน ",
                "ซึ่งจะช่วยลดการแพร่กระจายของเชื้อโรคสาเหตุ แต่ไม่ควรให้เช้าเกินไป",
                " ควรรอให้น้ำค้างระเหยไปก่อน (หรือใช้วิธีการล้างใบร่วมด้วย)ในขณะเดียวกันก็ไม่ควรให้น้ำในเวลาเย็น",
                " เพราะจะเป็นการเพิ่มความชื้นในเวลากลางคืนซึ่งจะเหมาะแก่การแพร่กระจายของโรคได้",
                " การให้น้ำควรจะทำให้เสร็จสิ้นภายในเวลา 14.00 น.",
                " เพื่อที่ให้ความร้อนและแสงแดดช่วยลดความชื้นให้แปลงปลูกลง",
                " เนื่องจากราน้ำค้างจะเจริญได้ดีในช่วงอุณหภูมิ 16-27 องศาเซลเซียส",
                " ที่ความชื้นสูงกว่า 86 % วิธีการล้างใบ ฉีดพ่นน้ำจากส่วนบนของทรงพุ่มลงด้านล่างของลำต้น",
                " ในช่วงเช้า สามารถทำควบคู่ไปกับการให้น้ำ เพื่อเป็นการล้างน้ำค้างออกจากใบพืช",
                " โดยเฉพาะในช่วงที่มีอากาศหนาวเย็น หรือ น้ำค้างลงจัด ",
                "หลังล้างใบพืชแล้วควรฉีดพ่นน้ำส้มควันไม้ในอัตรา 100 ซีซี ต่อน้ำเปล่า 12 ลิตร",
                " ฉีดพ่นจากบนลงล่าง คลุมให้ทั่วทรงพุ่มของพืช ทุกๆ 7-10 วัน ",
                " นอกจากนี้ควรหลีกเลี่ยงการปลูกพืชชิดหรือแน่นจนเกินไปเพื่อลดความชื้นที่จะเกิดขึ้น ",
                "ควรวางผังแปลงให้มีการถ่ายเทอากาศดีและได้รับแสงแดดเพียงพอ และควรทำความสะอาดแปลงปลูกอย่างสม่ำเสมอ ",
                "โดยทำลายต้นที่เป็นโรคและกำจัดเศษซากพืชที่เป็นโรคออกนอกแปลงโดยการขุดไปเผาทิ้ง ",
                "ยกร่องแปลงปลูกให้สูง จัดการเรื่องการระบายน้ำหรือการชลประทานให้ดี",
                " อย่าให้ชื้นแฉะหรือมีน้ำขังติดต่อกันนานเกินไป ใช้พันธุ์ที่ปราศจากโรค",
                " คลุกเมล็ดก่อนปลูกด้วยสารป้องกันกำจัดโรคพืชเมตาแลกซิล ",
                "จากนั้นในช่วงระยะเตรียมดินปลูกให้ใส่หินแร่ภูเขาไฟพูมิชซัลเฟอร์ผสมดินปลูก",
                " แต่ไม่ได้ป้องกัน 100% ถ้าในระยะที่มีฝนตกเยอะ ควรฉีดพ่นป้องกันด้วย แซนโธไนท์(สารสกัดเปลือกมังคุด)",
                " เพื่อให้สารแซนโธไนท์ ไปล้างทำลายสปอร์เชื้อราที่ปลิวมาเกาะที่ใบ",
                " นอกจากนี้สามารถทำลายสปอร์ของเชื้อราตั้งแต่แรกได้",
                "ไม่ให้สปอร์ระบาดรุกรามกลายเป็นเชื้อราน้ำค้างด้วยจุลินทรีย์สายพันธุ์บาซิลัสซับธิลิส",
                " หรือ ไบโอเซ็นเซอร์ โดยใช้ในอัตรา 50 กรัมผสมน้ำ 20 ลิตร ฉีดพ่นให้เปียกชุ่มทุก 3 วันติดกัน 3 ครั้ง ",
                "นอกจากนี้ยังสามารถฉีดพ่นด้วยสูตรผสมคือ ฟลูโอพิโคโล+ฟอสอีทิล-อะลูมิเนียม, อีทาบ็อกแซม,",
                " ไซม๊อกซานิล+ฟาม็อกซาโดน, แมนโคเซบ+แมนดิโพรพามิด, ไซม็อกซานิล+แมนโคเซบ, คลอโรทาโลนิ",
                " ควรทําทันทีเมื่อเริ่มมีโรคเกิดขึ้น สําหรับการป้องกันควรทําหลังจากต้นแตงเกิด ใบจริงแล้ว 2-5 ใบ",
                " โดยทําการฉีดทุกๆ 5 วัน หรือ 2 ครั้งใน 1 อาทิตย์ หากสิ่งแวดล้อมเหมาะสม",
                " และทํา ต่อเนื่องไปจนกระทั่งพืชแข็งแรงพ้นระยะการระบาดของโรค"
            ],
            "refer_arr": [
                {
                    "refer": "- สมปอง ฉิมดำ บ้านเล่นที่ 30 หมู่ที่ 1 ต.บ้านขาว อ.ระโนด จ.สงขลา",
                    "url": None
                },
                {
                    "refer": "-โรคราน้ำค้าง ใน คลีนิกพืช สำนักพัฒนาคุณภาพสินค้าเกษตร กรมส่งเสริมการเกษตร กระทรวงเกษตรและสหกรร์.(ออนไลน์).",
                    "url": "http://forecast.doae.go.th/web/onion/253-disease-of-onion/1232-peronospora-destructor.html"
                },
                {
                    "refer": "-อมรรัตน์  ภูไพบูลย์  พีระวรรณ พัฒนวิภาส  ปิยรัตน์  ธรรมกิจวัฒน์  พจนนา  ตระกูลสุขรัตน์ และเพลินพิศ สงสังข์. 2550.ราน้ำค้าง..ผัก.  น.ส.พ. กสิกร 50 (2) : 58 – 62",
                    "url": None
                },
                {
                    "refer": "- นายจตุโชค จันทรภูมี(นักวิชาการ) ชมรมเกษตรปลอดสารพิษ (ออนไลน์) ",
                    "url": " www.thaigreenagro.com"
                },
                {
                    "refer": "-  (ออนไลน์) ",
                    "url": "https://www.allkaset.com/diseases/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%A3%E0%B8%B2%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%84%E0%B9%89%E0%B8%B2%E0%B8%87.php"
                },
                {
                    "refer": "- ฐานข้อมูลพืชผัก บทความเกษตร (ออนไลน์)  ",
                    "url": "https://vegetweb.com/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%A1%E0%B8%A5%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%A8%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%B9%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%A1/"
                },
                {
                    "refer": "- SVGROUP (โรคราน้ำค้างในพืชตระกูลแตง) (ออนไลน์)  ",
                    "url": "https://www.svgroup.co.th/blog/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%A3%E0%B8%B2%E0%B8%99%E0%B9%89%E0%B8%B3%E0%B8%84%E0%B9%89%E0%B8%B2%E0%B8%87%E0%B9%83%E0%B8%99%E0%B8%9E%E0%B8%B7%E0%B8%8A%E0%B8%95%E0%B8%A3%E0%B8%B0%E0%B8%81%E0%B8%B9/"
                }
            ]
        },
        {
            "No": "1",
            "degree": [
                20,
                40
            ],
            "Symptoms": "ใบเป็นจุดแผลสีเขียวซีด",
            "Recommendation_purpose": "เพื่อป้องกัน และกำจัดโรค",
            "Recommended_method": [
                "ควรพ่นด้วยสารป้องกันกำจัดโรคพืชเบนโนมิล หรือคาร์เบนดาซิมผสมน้ำพ่นบนต้นพืช ",
                "หรือ พ่นด้วย ริดโดมิลโกลด์ เอ็มแซด , เทอรานิล หรือ เอคโค ให้เร็วที่สุดเมื่อเกิดโรคแล้ว",
                " หรือจะใช้แอ็คนาว-เอฟ, โค-ราช, ไซม๊อกซิเมท, นิวบอร์นฉีดพ่น นอกจากนั้นสามารถฉีดพ่นด้วย",
                " ไอเอส ในอัตราส่วน 50 ซีซี ต่อน้ำ 20 ลิตร ทุก 5-7 วัน แปลงที่เป็นโรค ",
                "ควรหลีกเลี่ยงการให้น้ำในตอนเย็นเพราะจะทำให้เกิดความชื้นเกินไป หรือหลีกเลี่ยงการใช้สารเคมีด้วยสมุนไพรพื้นบ้าน ",
                " เช่น สะเดา + ข่าแก่ + ตะไคร้ + หอม ",
                ":ซึ่งมีฤทธิ์ในการกำจัดราน้ำค้างด้วยการเตรียมหัวเชื้อจากสมนไพรดังกล่าวแล้วนำหัวเชื้อ 20-50 มิลลิลิตร",
                " ต่อน้ำสะอาด 20 ลิตร ฉีดพ่นทุก 3-5 วัน ห้ามใช้ในอัตราส่วนที่เข้มข้นเกินไป อาจจะทำให้ใบไหม้ "
            ],
            "refer_arr": [
                {
                    "refer": "-อมรรัตน์  ภูไพบูลย์  พีระวรรณ พัฒนวิภาส  ปิยรัตน์  ธรรมกิจวัฒน์  พจนนา  ตระกูลสุขรัตน์ และเพลินพิศ สงสังข์. 2550.ราน้ำค้าง..ผัก.  น.ส.พ. กสิกร 50 (2) : 58 – 62",
                    "url": None
                },
                {
                    "refer": "- ฐานข้อมูลพืชผัก บทความเกษตร (ออนไลน์)  ",
                    "url": "https://vegetweb.com/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%A1%E0%B8%A5%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%A8%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%B9%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%A1/"
                },
                {
                    "refer": "- (ออนไลน์)  ",
                    "url": "https://www.farmkaset.org/fkis/timeline-details.aspx?topicid=5387"
                },
                {
                    "refer": "- เกษตรกรรมปลอดภัย ด้วยสมุนไพรไทย ๆ ใกล้ตัว (ออนไลน์)  ",
                    "url": "https://www.kubotasolutions.com/knowledge/rice/detail/34"
                }
            ]
        },
        {
            "No": "2",
            "degree": [
                40,
                60
            ],
            "Symptoms": "ใบเป็นจุดแผลสีเหลือง",
            "Recommendation_purpose": "เพื่อป้องกัน และกำจัดโรค",
            "Recommended_method": [
                "ควรใช้แมนโคเซบ + เมทาแลกซิล-เอ็ม 64% + 4% ดับเบิ้ลยูจี อัตรา 50 กรัมต่อน้ำ 20 ลิตร ",
                "หรือ ไซมอกซานิล + ฟามอกซาโดน 30% + 22.5% ดับเบิ้ลยูจีอัตรา 10-5 กรัมต่อน้ำ 20 ลิตร ",
                "หรือ ไดเมโทมอร์ฟ 50% ดับเบิ้ลยูพี อัตรา 10-20 กรัมต่อน้ำ 20 ลิตร ",
                "หรือ แมนโคเซบ 80% ดับเบิ้ลยูพี อัตรา 20-30 กรัมต่อน้ำ 20 ลิตร พ่นทุก 5-7 วัน "
            ],
            "refer_arr": [
                {
                    "refer": "- กรมวิชาการเกษตร.2561.เตือนภัยเกษตร",
                    "url": None
                }
            ]
        },
        {
            "No": "3",
            "degree": [
                60,
                80
            ],
            "Symptoms": "ใบเป็นจุดแผลสีเหลืองและสีน้ำตาล",
            "Recommendation_purpose": "เพื่อป้องกัน และกำจัดโรค",
            "Recommended_method": [
                "ควรใช้ไดเมโทมอร์ฟ 50% WP อัตรา 20 – 30 กรัมต่อน้ำ 20 ลิตร ",
                " หรือแมนโคเซบ + เมทาแลกซิล-เอ็ม 64% + 4%WG อัตรา 50 - 60 กรัมต่อน้ำ 20 ลิตร",
                " หรือ ไซมอกซานิล + แมนโคเซบ 8% + 64% WP อัตรา 30 - 40 กรัมต่อน้ำ 20 ลิตร",
                " หรือแมนโคเซบ + วาลิฟีนาเลท 60% + 6% WG อัตรา 50 กรัมต่อน้ำ 20 ลิตร ",
                "โดยพ่นให้ทั่วทั้งบนใบและใต้ใบ ทุก 5 - 7 วัน หลีกเลี่ยงการให้น้ำในตอนเย็นเพื่อลดความชื้น"
            ],
            "refer_arr": [
                {
                    "refer": "- กรมวิชาการเกษตร.2564.เตือนภัยเกษตร",
                    "url": None
                }
            ]
        },
        {
            "No": "4",
            "degree": [
                80,
                100
            ],
            "Symptoms": "ใบเป็นจุดสีน้ำตาลขยายเป็นสี่เหลี่ยมระหว่างเส้นใบ",
            "Recommendation_purpose": "เพื่อป้องกัน และกำจัดโรค",
            "Recommended_method": [
                "หากมีอาการรุนแรงควรใช้ลอนมิเนต 1-2 ช้อน ผสมกับน้ำ 20 ลิตร",
                " ฉีดพ่นทุกๆ 7 วัน ประมาณ 3 ครั้ง หรือ ผสมน้ำ 20 ลิตร และแทนเอ็ม 15 กรัม ",
                "และโนมิลดิว (No Mildew) 25 กรัม ถ้าเกิดถึงขั้นรุนแรงเมื่อหลังเก็บเกี่ยวผลผลิต ",
                " ควรเก็บซากพืชไปเผาไฟทำลายนอกแปลงปลูก และไม่ปลูกพืชตระกูลแตงซ้ำ ",
                "ควรปลุกพืชชนิดอื่นหมุนเวียน "
            ],
            "refer_arr": [
                {
                    "refer": "- ฐานข้อมูลพืชผัก บทความเกษตร (ออนไลน์)  ",
                    "url": "https://vegetweb.com/%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B9%80%E0%B8%A1%E0%B8%A5%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%A8%E0%B8%B1%E0%B8%95%E0%B8%A3%E0%B8%B9%E0%B8%82%E0%B8%AD%E0%B8%87%E0%B9%80%E0%B8%A1/"
                }
            ]
        }
    ]
}


